projet-blog/server/artillery/load-test.yml
config:
  target: "http://localhost:3000"
  phases:
    - duration: 10
      arrivalRate: 5
      name: "Warm up"
    - duration: 30
      arrivalRate: 10
      rampTo: 20
      name: "Ramp up load"
    - duration: 60
      arrivalRate: 20
      name: "Sustained load"

scenarios:
  - name: "Blog operations"
    flow:
      # GET articles
      - get:
          url: "/api/articles"
          expect:
            - statusCode: 200

      # CREATE article
      - post:
          url: "/api/articles"
          json:
            title: "Test Article {{ $randomNumber(1,1000) }}"
            content: "This is a test content {{ $randomString(50) }}"
            image_url: "https://picsum.photos/200/300"
            image_alt: "Test image"
          capture:
            - json: "$.id"
              as: "articleId"
          expect:
            - statusCode: 200

      # GET specific article
      - get:
          url: "/api/articles/{{ articleId }}"
          expect:
            - statusCode: 200

      # UPDATE article
      - put:
          url: "/api/articles/{{ articleId }}"
          json:
            title: "Updated Article {{ $randomNumber(1,1000) }}"
            content: "Updated content {{ $randomString(50) }}"
            image_url: "https://picsum.photos/200/300"
            image_alt: "Updated test image"
          expect:
            - statusCode: 200

      # DELETE article
      - delete:
          url: "/api/articles/{{ articleId }}"
          expect:
            - statusCode: 200

      # Think time between operations
      - think: 2